 
 myFunc();
 function myFunc()  // פונקציה רגילה
 {
 
 }
 
 
 //-------------------------------------------------------------------------------------------------------------------------
 

 // פונקציית חץ איננה ניתנת להגדרה, מכיוון שהיא אנונימית
 // פונקציית חץ- זוהי צורת כתיבה של פונקציות מקוצרת Lambda


// פונקציה רגילה ניתן להגדיר
function Calc(cb) { // פונקציה ראשונה
    return cb();
}

// שלחית פונקציית חץ כפרמטר לפונקציה (הראשונה)
Calc(()=>{
    return 1.17;  // קבלת הפרמטר (תשובה)  , זה פונקציה בתוך פונקציה 
})



//-------------------------------------------------------------------------------------------------------------------------


let a = function(x,y){  //a פונקציה בתוך משתנה 
    return x+y;
};

a();  // ousting  ניתן לזמן אך ורק אחרי ההכרזה של הפונקציה זה נקרא פעולת


//--------------------------------------------------------------------------------------------------------------------



let b = (x,y)=> x+y;  // דרך 1 לשימוש בפונקציה חץ - היא מקבלת רק פרמטר אחד (פעולה אחת)
let answer1 = b(5,8);


let c = (x,y)=> {  // דרך 2 לשימוש בפונקציה חץ - היא מקבלת יותר מפרמטר אחד (כמה פעולות)
    return x+y;
};
let answer2 = c(4,1);



//--------------------------------------------------------------------------------------------------------------------



